FMDHET/deye-inverter-display-esp32-p4/sdkconfig.defaults
# Deye-Display -- defaults applied on top of the board's sdkconfig.
# Target board: GUITION JC4880P443C (ESP32-P4, 480x800 MIPI-DSI, GT911 touch).
CONFIG_IDF_TARGET="esp32p4"

# Some ESP32-P4 dev boards ship ECO2 silicon (rev < 3.0). The default IDF
# target assumes rev 3.x and emits xespv2p2 instructions ECO2 cannot
# decode. Pinning the lower min-rev keeps the binary compatible with both
# ECO2 and rev3 silicon (safe lower bound, costs only minor optimizations).
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# 16 MB flash.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Automatic OTA rollback. A freshly flashed image boots in state
# PENDING_VERIFY and is kept only after the firmware confirms itself via
# ota_mark_app_valid() (main.c, once /ota is reachable again). A build that dies
# before that -- e.g. asserting inside esp_hosted before app_main, which has
# happened here -- is reverted to the previous slot by the bootloader on the
# next boot, instead of leaving a device that only a USB cable can rescue.
#
# NOTE: this lives in the BOOTLOADER. OTA only replaces the app, so the option
# takes effect only after the bootloader itself has been flashed over USB once.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Custom partition table -- default factory partition is only 1 MB, our
# image with WiFi + LVGL is ~1.2 MB and growing.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 32 MB PSRAM -- required for the display framebuffer (480*800*2 = 768 KB).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL NICHT hochsetzen -- gemessen wirkungslos.
#
# Hintergrund: OTA ueber WLAN stuerzt sporadisch mitten im Firmware-Schreiben ab.
# Die Stelle ist der esp_hosted-SDIO-Treiber, der seinen Empfangspuffer im
# Streaming-Modus zur Laufzeit wachsen laesst (alten freigeben, groesseren per
# malloc holen). Der Puffer muss DMA-faehig sein, und scheitert das malloc,
# quittiert der Treiber das mit assert(*buf) -- also Absturz statt Fehlerpfad:
#     assert failed: sdio_rx_get_buffer sdio_drv.c:953 (*buf)
#     want=5120 prev_size=4608 int_largest=31744 dma_free=9627 dma_largest=4608
# Der interne RAM reichte also (31 KB am Stueck), der DMA-faehige nicht.
#
# Naheliegend war, die DMA-Reserve zu vergroessern (32 KB -> 96 KB). Wirkungslos:
# der Pool war nachweislich aktiv ("Reserving pool of 96K"), doch waehrend des
# Schreibens fiel er auf dma_free=4743 dma_largest=1344 -- noch tiefer als die
# 4608 B, an denen es vorher krachte. Der Verbrauch richtet sich nach dem, was
# gerade hereinkommt: mehr Reserve heisst nur, dass der Netzwerkstack mehr
# puffert, und der freie Rest bleibt gleich knapp. Die 64 KB internen RAM sind
# damit umsonst gebunden, deshalb steht hier wieder die Vorgabe (32 KB).
#
# Messwerte liefert GET /ota (dma, dma_max, dma_min) sowie die Zeilen
# "OTA <n> KB: dma_free=... dma_largest=..." waehrend eines laufenden Updates.

CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ---------------------------- LVGL 9 -------------------------------------
# Color depth must match the panel framebuffer (RGB565).
CONFIG_LV_COLOR_DEPTH_16=y

# Enable the Montserrat sizes the Phase-1 UI uses.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# Route lv_malloc through newlib's malloc, which on ESP-IDF picks up
# both internal SRAM and PSRAM via heap_caps. Using LVGL's built-in
# allocator would place a multi-hundred-KB static array in .bss, which
# does not fit in the P4's 320 KB internal SRAM.
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y

# Use FreeRTOS-aware mutexes inside LVGL.
CONFIG_LV_OS_FREERTOS=y

# Hardware-accelerated 90° rotation via the ESP32-P4 PPA, used by
# esp_lvgl_port for the portrait->landscape rotation.
CONFIG_LVGL_PORT_ENABLE_PPA=y

# lv_snapshot renders the live screen into a buffer; the P4 hardware JPEG
# encoder then compresses it for the web mirror (see main/web_mirror.c).
CONFIG_LV_USE_SNAPSHOT=y

# Tiny-TTF: render the bundled Montserrat TTF at runtime so German umlauts
# (ae/oe/ue/ss) work. The built-in bitmap montserrat fonts have no umlauts;
# we use tiny-ttf for text and fall back to them for the FontAwesome symbols.
CONFIG_LV_USE_TINY_TTF=y

# Tiny-TTF rasterises glyphs at runtime and stores them in the LVGL cache.
# The default cache size is 0 (disabled) -> tiny-ttf glyphs fail to render and
# fall back to the bitmap font (umlauts show as boxes). Give it a real cache.
CONFIG_LV_CACHE_DEF_SIZE=262144

# ---------------------------- ESP-Hosted (WiFi via C6) -------------------
# The JC4880P443C carries an ESP32-C6 on-module that does the WiFi/BT.
# The P4 talks to it over SDIO; esp_hosted hands the standard
# esp_wifi / esp_netif APIs through to the C6's stack.
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y

# SDIO-Transportpuffer im PSRAM statt im internen DMA-Pool.
#
# Der eigentliche Hebel gegen den OTA-Absturz (assert in sdio_rx_get_buffer,
# siehe oben bei SPIRAM_MALLOC_RESERVE_INTERNAL): esp_hosted holt seine
# Empfangspuffer per hosted_malloc_align() -- mit dieser Option zuerst aus
# DMA-faehigem PSRAM (32 MB, nie knapp) und erst bei Misserfolg aus dem
# internen RAM. Espressif hat die Option ausdruecklich fuer den P4 gebaut, dessen
# GDMA den PSRAM ueber den Cache erreicht. Rein hostseitig: der mit dem C6
# ausgehandelte Streaming-Modus bleibt unangetastet. Preis laut Kconfig etwas
# Transportlatenz -- fuer Modbus-Polling und MQTT ohne Belang.
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y

# SDIO-Empfangsmodus NICHT umstellen.
# CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_MAX_SIZE wurde probiert, um den
# waehrend eines OTA scheiternden Neuallokations-Pfad im Streaming-Modus zu
# umgehen (assert(*buf) in sdio_rx_get_buffer). Ergebnis: Bootschleife.
#     assert failed: process_init_event transport_drv.c:879 (0)
# Der Modus wird beim Verbindungsaufbau mit dem C6 ausgehandelt; die auf dem
# Modul geflashte Co-Prozessor-Firmware erwartet Streaming. Host und C6 sind ein
# Paar -- der Modus laesst sich nur zusammen mit der C6-Firmware aendern.

# Bigger main-task stack: WiFi+netif init + LVGL UI builds together at
# boot push the default 3.5 KB main stack close to its limit.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Bigger system-event task stack: WiFi event handlers run here and the
# default 2304 B is tight once scan-result handling is added.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# More LWIP sockets: two HTTP servers (:80 page/touch/ota, :81 MJPEG stream)
# + DNS + Modbus-TCP need more than the default 10, or the web server starves.
#
# 16 is the value this board is known to run with. 24 was tried for the Modbus
# bridge and the device stopped booting -- but that turned out to be a RED
# HERRING: the same firmware rebuilt with 16 failed identically, and the serial
# log showed app_main was never reached at all. The real trigger was the ESP-IDF
# version (5.5.5 asserts in esp_hosted's SDIO init, 5.5.4 boots) -- see the
# framework pin in platformio.ini.
#
# So this is NOT a hard ceiling, it is simply the untested-vs-proven line: 24 has
# never been shown to boot on this board. If the bridge ever needs more sockets,
# raising it is fair game -- but flash that build over USB with a serial monitor
# attached, because a boot failure here happens before WiFi and therefore before
# OTA can rescue it. The bridge is sized to not need it: off by default, capped
# at MB_GW_MAX_CLIENTS (4) sockets.
CONFIG_LWIP_MAX_SOCKETS=16

# Short TIME_WAIT: with the 16 sockets above shared between the two HTTP
# servers, MQTT, WireGuard, DNS, the Modbus-TCP<->RTU bridge and the PERSISTENT
# Modbus-TCP worker sockets, a 60 s MSL (=120 s TIME_WAIT) let closed HTTP
# connections (web-mirror touch polling, /api churn) pile up and starve the pool
# until httpd stopped accepting (and large OTA uploads got refused). 5 s MSL
# (=10 s TIME_WAIT) frees sockets fast; safe on LAN. Doubly important now that
# the pool cannot be grown -- see above.
CONFIG_LWIP_TCP_MSL=5000

# tcpip-Task-Stack: die Vorgabe sind 3072 B. WireGuard laeuft aber IM
# tcpip-Thread (netif->input/output, wireguardif_tmr): x25519-Handshake,
# BLAKE2s, ChaCha20-Poly1305. Das README der Komponente verlangt 5 KB. Trifft
# ein Handshake ein, waehrend ein TCP-Segment verarbeitet wird, ist die
# Stack-Canary weg -- Panic im tcpip_thread, Neustart, und wenn das der erste
# Start nach einem OTA war, ein Rollback.
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=6144

# Task-Watchdog: mit der Vorgabe schreibt er nur alle 5 s eine Logzeile. Eine
# Task, die den Leerlauf aushungert, laesst das Geraet an der Wand damit
# halbtot haengen, bis jemand den Stecker zieht -- und "TASK_WDT" in /ota
# konnte nie vorkommen. Jetzt Panic + Neustart; der Rollback faengt es, wenn
# es die frisch geflashte Firmware war.
CONFIG_ESP_TASK_WDT_PANIC=y

# Enable bridge support purely to flip LWIP_ESP_NETIF_DATA=1, so esp_netif stores
# its handle in lwIP client-data (not netif->state). Required so the WireGuard
# raw lwIP netif (state = wireguard_device) doesn't crash esp_netif's DHCP
# ext-callback (Load access fault in esp_netif_internal_dhcpc_cb). See wg_client.
CONFIG_ESP_NETIF_BRIDGE_EN=y

# This checkout lives under ".../Visual Studio Code/...". IDF's path-hiding adds
# -fmacro-prefix-map=<project dir>=. which GCC parses as a plain argument, so a
# space in the project path aborts every compile with
#   cc1: error: invalid argument '/Users/.../Visual' to '-fmacro-prefix-map'
# There is no quoting that survives the CMake -> ninja -> cc1 hand-off, and a
# symlinked whitespace-free path does not help (CMake resolves the realpath).
# Turning the remap off costs only cosmetics: __FILE__ in assert/log messages
# becomes an absolute path instead of a relative one. PlatformIO's own guard
# still refuses a BUILD_DIR containing spaces -- keep building with
#   PLATFORMIO_BUILD_DIR=~/pio-build/deye-display pio run -e guition-p4 ...
CONFIG_COMPILER_HIDE_PATHS_MACROS=n
